hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpiod.h
/*
; stm32N657_gpiod.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_gpiod equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// GPIOD address definitions
// -------------------------

typedef struct {
	volatile	uint32_t	MODER;
	volatile	uint32_t	OTYPER;
	volatile	uint32_t	OSPEEDR;
	volatile	uint32_t	PUPDR;
	volatile	uint32_t	IDR;
	volatile	uint32_t	ODR;
	volatile	uint32_t	BSRR;
	volatile	uint32_t	LCKR;
	volatile	uint32_t	AFRL;
	volatile	uint32_t	AFRH;
	volatile	uint32_t	BRR;
	volatile	uint32_t	RESERVED0;
	volatile	uint32_t	SECCFGR;
	volatile	uint32_t	PRIVCFGR;
	volatile	uint32_t	RCFGLOCKR;
	volatile	uint32_t	RESERVED1;
	volatile	uint32_t	DELAYRL;
	volatile	uint32_t	DELAYRH;
	volatile	uint32_t	PIOCFGRL;
	volatile	uint32_t	PIOCFGRH;
	volatile	uint32_t	RESERVED2[222];
	volatile	uint32_t	HWCFGR10;
	volatile	uint32_t	HWCFGR9;
	volatile	uint32_t	HWCFGR8;
	volatile	uint32_t	HWCFGR7;
	volatile	uint32_t	HWCFGR6;
	volatile	uint32_t	HWCFGR5;
	volatile	uint32_t	HWCFGR4;
	volatile	uint32_t	HWCFGR3;
	volatile	uint32_t	HWCFGR2;
	volatile	uint32_t	HWCFGR1;
	volatile	uint32_t	HWCFGR0;
	volatile	uint32_t	VERR;
	volatile	uint32_t	IPIDR;
	volatile	uint32_t	SIDR;
} GPIOD_TypeDef;

#if (defined(__cplusplus))
#define	GPIOD_NS	reinterpret_cast<GPIOD_TypeDef *>(0x46020C00u)
#define	GPIOD_S		reinterpret_cast<GPIOD_TypeDef *>(0x56020C00u)

#else
#define	GPIOD_NS	((GPIOD_TypeDef *)0x46020C00u)
#define	GPIOD_S		((GPIOD_TypeDef *)0x56020C00u)
#endif

// MODER Configuration

#define	GPIOD_MODER_MODE15					(0x3u<<30)
#define	GPIOD_MODER_MODE15_0				(0x1u<<30)
#define	GPIOD_MODER_MODE14					(0x3u<<28)
#define	GPIOD_MODER_MODE14_0				(0x1u<<28)
#define	GPIOD_MODER_MODE13					(0x3u<<26)
#define	GPIOD_MODER_MODE13_0				(0x1u<<26)
#define	GPIOD_MODER_MODE12					(0x3u<<24)
#define	GPIOD_MODER_MODE12_0				(0x1u<<24)
#define	GPIOD_MODER_MODE11					(0x3u<<22)
#define	GPIOD_MODER_MODE11_0				(0x1u<<22)
#define	GPIOD_MODER_MODE10					(0x3u<<20)
#define	GPIOD_MODER_MODE10_0				(0x1u<<20)
#define	GPIOD_MODER_MODE9					(0x3u<<18)
#define	GPIOD_MODER_MODE9_0					(0x1u<<18)
#define	GPIOD_MODER_MODE8					(0x3u<<16)
#define	GPIOD_MODER_MODE8_0					(0x1u<<16)
#define	GPIOD_MODER_MODE7					(0x3u<<14)
#define	GPIOD_MODER_MODE7_0					(0x1u<<14)
#define	GPIOD_MODER_MODE6					(0x3u<<12)
#define	GPIOD_MODER_MODE6_0					(0x1u<<12)
#define	GPIOD_MODER_MODE5					(0x3u<<10)
#define	GPIOD_MODER_MODE5_0					(0x1u<<10)
#define	GPIOD_MODER_MODE4					(0x3u<<8)
#define	GPIOD_MODER_MODE4_0					(0x1u<<8)
#define	GPIOD_MODER_MODE3					(0x3u<<6)
#define	GPIOD_MODER_MODE3_0					(0x1u<<6)
#define	GPIOD_MODER_MODE2					(0x3u<<4)
#define	GPIOD_MODER_MODE2_0					(0x1u<<4)
#define	GPIOD_MODER_MODE1					(0x3u<<2)
#define	GPIOD_MODER_MODE1_0					(0x1u<<2)
#define	GPIOD_MODER_MODE0					(0x3u<<0)
#define	GPIOD_MODER_MODE0_0					(0x1u<<0)

#define	GPIOD_MODER_MODE15_B_0X0			(0x0u<<30)
#define	GPIOD_MODER_MODE15_B_0X1			(0x1u<<30)
#define	GPIOD_MODER_MODE15_B_0X2			(0x2u<<30)
#define	GPIOD_MODER_MODE15_B_0X3			(0x3u<<30)
#define	GPIOD_MODER_MODE14_B_0X0			(0x0u<<28)
#define	GPIOD_MODER_MODE14_B_0X1			(0x1u<<28)
#define	GPIOD_MODER_MODE14_B_0X2			(0x2u<<28)
#define	GPIOD_MODER_MODE14_B_0X3			(0x3u<<28)
#define	GPIOD_MODER_MODE13_B_0X0			(0x0u<<26)
#define	GPIOD_MODER_MODE13_B_0X1			(0x1u<<26)
#define	GPIOD_MODER_MODE13_B_0X2			(0x2u<<26)
#define	GPIOD_MODER_MODE13_B_0X3			(0x3u<<26)
#define	GPIOD_MODER_MODE12_B_0X0			(0x0u<<24)
#define	GPIOD_MODER_MODE12_B_0X1			(0x1u<<24)
#define	GPIOD_MODER_MODE12_B_0X2			(0x2u<<24)
#define	GPIOD_MODER_MODE12_B_0X3			(0x3u<<24)
#define	GPIOD_MODER_MODE11_B_0X0			(0x0u<<22)
#define	GPIOD_MODER_MODE11_B_0X1			(0x1u<<22)
#define	GPIOD_MODER_MODE11_B_0X2			(0x2u<<22)
#define	GPIOD_MODER_MODE11_B_0X3			(0x3u<<22)
#define	GPIOD_MODER_MODE10_B_0X0			(0x0u<<20)
#define	GPIOD_MODER_MODE10_B_0X1			(0x1u<<20)
#define	GPIOD_MODER_MODE10_B_0X2			(0x2u<<20)
#define	GPIOD_MODER_MODE10_B_0X3			(0x3u<<20)
#define	GPIOD_MODER_MODE9_B_0X0				(0x0u<<18)
#define	GPIOD_MODER_MODE9_B_0X1				(0x1u<<18)
#define	GPIOD_MODER_MODE9_B_0X2				(0x2u<<18)
#define	GPIOD_MODER_MODE9_B_0X3				(0x3u<<18)
#define	GPIOD_MODER_MODE8_B_0X0				(0x0u<<16)
#define	GPIOD_MODER_MODE8_B_0X1				(0x1u<<16)
#define	GPIOD_MODER_MODE8_B_0X2				(0x2u<<16)
#define	GPIOD_MODER_MODE8_B_0X3				(0x3u<<16)
#define	GPIOD_MODER_MODE7_B_0X0				(0x0u<<14)
#define	GPIOD_MODER_MODE7_B_0X1				(0x1u<<14)
#define	GPIOD_MODER_MODE7_B_0X2				(0x2u<<14)
#define	GPIOD_MODER_MODE7_B_0X3				(0x3u<<14)
#define	GPIOD_MODER_MODE6_B_0X0				(0x0u<<12)
#define	GPIOD_MODER_MODE6_B_0X1				(0x1u<<12)
#define	GPIOD_MODER_MODE6_B_0X2				(0x2u<<12)
#define	GPIOD_MODER_MODE6_B_0X3				(0x3u<<12)
#define	GPIOD_MODER_MODE5_B_0X0				(0x0u<<10)
#define	GPIOD_MODER_MODE5_B_0X1				(0x1u<<10)
#define	GPIOD_MODER_MODE5_B_0X2				(0x2u<<10)
#define	GPIOD_MODER_MODE5_B_0X3				(0x3u<<10)
#define	GPIOD_MODER_MODE4_B_0X0				(0x0u<<8)
#define	GPIOD_MODER_MODE4_B_0X1				(0x1u<<8)
#define	GPIOD_MODER_MODE4_B_0X2				(0x2u<<8)
#define	GPIOD_MODER_MODE4_B_0X3				(0x3u<<8)
#define	GPIOD_MODER_MODE3_B_0X0				(0x0u<<6)
#define	GPIOD_MODER_MODE3_B_0X1				(0x1u<<6)
#define	GPIOD_MODER_MODE3_B_0X2				(0x2u<<6)
#define	GPIOD_MODER_MODE3_B_0X3				(0x3u<<6)
#define	GPIOD_MODER_MODE2_B_0X0				(0x0u<<4)
#define	GPIOD_MODER_MODE2_B_0X1				(0x1u<<4)
#define	GPIOD_MODER_MODE2_B_0X2				(0x2u<<4)
#define	GPIOD_MODER_MODE2_B_0X3				(0x3u<<4)
#define	GPIOD_MODER_MODE1_B_0X0				(0x0u<<2)
#define	GPIOD_MODER_MODE1_B_0X1				(0x1u<<2)
#define	GPIOD_MODER_MODE1_B_0X2				(0x2u<<2)
#define	GPIOD_MODER_MODE1_B_0X3				(0x3u<<2)
#define	GPIOD_MODER_MODE0_B_0X0				(0x0u<<0)
#define	GPIOD_MODER_MODE0_B_0X1				(0x1u<<0)
#define	GPIOD_MODER_MODE0_B_0X2				(0x2u<<0)
#define	GPIOD_MODER_MODE0_B_0X3				(0x3u<<0)

// OTYPER Configuration

